CSE/7thSem/web-lab/12/app/controllers/books_controller.rb

INSERT INTO `books` (`access_no`, `author`, `created_at`, `edition`, `publisher`, `title`, `updated_at`) VALUES (100, 'A', '2013-10-29 18:24:15', 1, 'P1', 'Rails', '2013-10-29 18:24:15')
---
  def add
	Book.create(:ano=> params[:b_ano],:title=> params[:b_title],:author=> params[:b_author],:edition=> params[:b_edition],:publisher=> params[:b_publisher])