CSE/7thSem/web-lab/12/app/views/books/search.html.erb

SELECT `books`.* FROM `books` WHERE `books`.`title` = 'Ruby' LIMIT 1
---
<table border=1>
	 <% @t=Book.find_by_title(params[:bs_title]) %>